zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_dma_dmac.c
/** Gets the dmac configuration struct from block and channel */
static inline cyhal_dma_t* _cyhal_dma_dmac_get_obj(uint8_t block, uint8_t channel)
{
    return _cyhal_dma_dmac_config_structs[(block * CPUSS_DMAC0_CH_NR) + channel];
}

/** Gets the dmac block number from irq number */
/** This should never be called from a non-dma IRQn */
static inline uint8_t _cyhal_dma_dmac_get_block_from_irqn(IRQn_Type irqn)
{
    uint8_t diff = irqn - DMAC0_IRQn;
#if defined(CPUSS_DMAC0_CH_NR) && !defined(CPUSS_DMAC1_CH_NR)
    CY_ASSERT(diff < CPUSS_DMAC0_CH_NR);

    if (diff < CPUSS_DMAC0_CH_NR)
        return 0;
#elif defined(CPUSS_DMAC0_CH_NR) && defined(CPUSS_DMAC1_CH_NR)
    CY_ASSERT(diff < CPUSS_DMAC0_CH_NR + CPUSS_DMAC1_CH_NR);

    if (diff < CPUSS_DMAC0_CH_NR)
        return 0;
    if (diff < CPUSS_DMAC0_CH_NR + CPUSS_DMAC1_CH_NR)
        return 1;
#endif

    // Should never reach here. Just silencing compiler warnings.
    CY_ASSERT(false);
    return 0xFF;
}

#if defined(CY_IP_M4CPUSS_DMAC) || defined(CY_IP_MXAHBDMAC)
/** Gets the dmac channel number from irq number */
/** This should never be called from a non-dma IRQn */
static inline uint8_t _cyhal_dma_dmac_get_channel_from_irqn(IRQn_Type irqn)
{
    uint8_t diff = irqn - DMAC0_IRQn;
#if defined(CPUSS_DMAC0_CH_NR) && !defined(CPUSS_DMAC1_CH_NR)
    CY_ASSERT(diff < CPUSS_DMAC0_CH_NR);

    if (diff < CPUSS_DMAC0_CH_NR)
        return diff;
#elif defined(CPUSS_DMAC0_CH_NR) && defined(CPUSS_DMAC1_CH_NR)
    CY_ASSERT(diff < CPUSS_DMAC0_CH_NR + CPUSS_DW1_CH_NR);

    if (diff < CPUSS_DMAC0_CH_NR)
        return diff;
    else
        return diff - CPUSS_DMAC0_CH_NR;
#endif

    // Should never reach here. Just silencing compiler warnings.
    CY_ASSERT(false);
    return 0xFF;
}
#endif

/** Gets the irqn corresponding to a particular cyhal_dma_t config struct */
static inline IRQn_Type _cyhal_dma_dmac_get_irqn(cyhal_dma_t *obj)
{
    #if defined(CY_IP_M0S8CPUSSV3_DMAC)
        CY_UNUSED_PARAMETER(obj);
        /* This IP has a single ganged IRQ for all DMA channels */
        return DMAC0_IRQn;
    #else
        return (IRQn_Type)((uint8_t)DMAC0_IRQn + _cyhal_dma_dmac_get_cfg_offset(obj));
    #endif
}

/** Gets the dmac base pointer from block number */
static inline cyhal_dmac_hw_type* _cyhal_dma_dmac_get_base(uint8_t block_num)
{
#if defined(CPUSS_DMAC0_CH_NR) && !defined(CPUSS_DMAC1_CH_NR)
    CY_UNUSED_PARAMETER(block_num);
    return DMAC;
#elif defined(CPUSS_DMAC0_CH_NR) && defined(CPUSS_DMAC1_CH_NR)
    return (block_num == 0) ? MXAHBDMAC0 : MXAHBDMAC1;
#endif
}

/** Uses tables provided as part of the hal interconnect driver to determine mux
 * trigger group and mux trigger index and then construct the trigger line
 * input parameter to Cy_TrigMux_SwTrigger. */
static inline uint32_t _cyhal_dma_dmac_get_trigger_line(uint8_t block_num, uint8_t channel_num)
{
    /* cyhal_dest_t triggers are guaranteed to be sorted by trigger type, block
     * num, then channel num, therefore, we can just directly find the proper
     * trigger by calculating an offset. */
    cyhal_dest_t trigger = (cyhal_dest_t)(CYHAL_TRIGGER_CPUSS_DMAC0_TR_IN0 + (block_num * CPUSS_DMAC0_CH_NR) + channel_num);

    /* One to one triggers have bit 8 set in cyhal_dest_to_mux but
     * Cy_TrigMux_SwTrigger wants the trigger group field to have bit 5 set to
     * denote one to one triggers. */
    uint8_t trig_group = cyhal_dest_to_mux[trigger];
    /* If hal one to one triggers bit is set: mask it out and set pdl one to
     * one bit */
    if(trig_group & _CYHAL_DMA_TRIGGERS_1TO1_MASK)
        trig_group = (trig_group & ~_CYHAL_DMA_TRIGGERS_1TO1_MASK) | _CYHAL_DMA_PDL_TRIGGERS_1TO1_MASK;

    /* Construct trigger line which consists of three fields packed into a
     * uint32_t:
     * Bits   30: Input/output bit. Set to 1 for output.
     * Bits 12-8: Trigger group selection.
     * Bits  7-0: Select the output trigger number in the trigger group. */
#if defined(CY_IP_M4CPUSS_DMAC) || defined(CY_IP_MXAHBDMAC)
    return PERI_TR_CMD_OUT_SEL_Msk | ((uint32_t)trig_group << 8) | cyhal_mux_dest_index[trigger];
#elif defined(CY_IP_M0S8CPUSSV3_DMAC)
    return PERI_TR_CTL_TR_OUT_Msk | ((uint32_t)trig_group << 8) | cyhal_mux_dest_index[trigger];
#endif
}

#if defined(CY_IP_M4CPUSS_DMAC) || defined(CY_IP_MXAHBDMAC)
/** Convert PDL interrupt cause to hal dma event */
static inline cyhal_dma_event_t _cyhal_dma_dmac_convert_interrupt_cause(cyhal_dma_t *obj, uint32_t cause)
{
    static const cyhal_dma_event_t hal[] =
    {
        CYHAL_DMA_TRANSFER_COMPLETE,
        CYHAL_DMA_SRC_BUS_ERROR,
        CYHAL_DMA_DST_BUS_ERROR,
        CYHAL_DMA_SRC_MISAL,
        CYHAL_DMA_DST_MISAL,
        CYHAL_DMA_CURR_PTR_NULL,
        CYHAL_DMA_ACTIVE_CH_DISABLED,
        CYHAL_DMA_DESCR_BUS_ERROR
    };

    cyhal_dma_event_t hal_rslt = CYHAL_DMA_NO_INTR;
    for (uint8_t i = 0; cause > 0 && i < sizeof(hal)/sizeof(cyhal_dma_event_t); i++)
    {
        if ((cause & (1 << i)) > 0)
        hal_rslt |= hal[i];
    }

    if ((uint32_t)(hal_rslt & CYHAL_DMA_TRANSFER_COMPLETE) > 0 && obj->expected_bursts > 0)
    {
        obj->expected_bursts--;
        if (0 == obj->expected_bursts)
        {
            hal_rslt |= CYHAL_DMA_DESCRIPTOR_COMPLETE;
#if defined(CY_IP_M4CPUSS_DMAC) || defined(CY_IP_MXAHBDMAC)
            obj->expected_bursts = (GET_RESOURCE_DATA(obj->descriptor_config).interruptType == CY_DMAC_X_LOOP)
                ? GET_RESOURCE_DATA(obj->descriptor_config).yCount
                : 1;
#else
            obj->expected_bursts = 1;
#endif
        }
    }

    return hal_rslt;
}
#endif

/** DMAC irq handler */
static void _cyhal_dma_dmac_irq_handler(void)
{
    /* Use irqn to get appropriate config structure */
    uint8_t block = _cyhal_dma_dmac_get_block_from_irqn(_CYHAL_UTILS_GET_CURRENT_IRQN());
    DMAC_Type* base = _cyhal_dma_dmac_get_base(block);
#if defined(CY_IP_M4CPUSS_DMAC) || defined(CY_IP_MXAHBDMAC)
    uint8_t channel = _cyhal_dma_dmac_get_channel_from_irqn(_CYHAL_UTILS_GET_CURRENT_IRQN());
    cyhal_dma_t *obj = _cyhal_dma_dmac_get_obj(block, channel);

